<?php
return [
    'admin' => [
        'categories' => [
            'create' => [
                'success' => 'Катеогрия успешно добавлена',
                'fail' => 'Ошибка добавления категории'
            ],
            'update' => [
                'success' => 'Категория успешно изменена',
                'fail' => 'Ошибка изменения категории'
            ],
            'destroy' => [
                'success' => 'Категория успешно удалена',
                'fail' => 'Ошибка удаления категории'
            ]
        ],
        'news' => [
            'create' => [
                'success' => 'Новость успешно добавлена',
                'fail' => 'Ошибка добавления новости'
            ],
            'update' => [
                'success' => 'Новость успешно изменена',
                'fail' => 'Ошибка изменения новости'
            ],
            'destroy' => [
                'success' => 'Новость успешно удалена',
                'fail' => 'Ошибка удаления новости'
            ]
        ],
        'sources' => [
            'create' => [
                'success' => 'Источник успешно добавлен',
                'fail' => 'Ошибка добавления источника'
            ],
            'update' => [
                'success' => 'Источник успешно изменен',
                'fail' => 'Ошибка изменения источника'
            ],
            'destroy' => [
                'success' => 'Источник успешно удален',
                'fail' => 'Ошибка удаления источника'
            ]
        ],
        'users' => [
            'update' => [
                'success' => 'Профиль пользователя успешно изменен',
                'fail' => 'Ошибка изменения профиля пользователя',
                'pass_fail' => 'Введенные пароли не совпадают'
            ],
            'destroy' => [
                'success' => 'Профиль пользователя успешно удален',
                'fail' => 'Ошибка удаления профиля пользователя'
            ]
        ]
    ]
];
